Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.FlipRebarSet
Flips the rebar set by changing the RebarPlane with the OutOfPlaneExtent and vice versa.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Since:
2023.1

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.SetRebarShapeId(Autodesk.Revit.DB.ElementId)
Changes the RebarShape element that defines the shape of the rebar.
Changing the value of this member causes the Rebar instance to choose values for its
shape parameters to preserve its previous shape as closely as possible
Throws Autodesk.Revit.Exceptions.ArgumentException:
shapeId is not the id of a RebarShape in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Since:
2018

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.ScaleToBoxFor3D(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double)
Move and resize a spiral or multiplanar instance to fit within a specified box.
The arguments are interpreted as an arbitrary rectangle in 3D with
vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. One end of the
rebar shape is inscribed in this rectangle following the procedure described
for the ScaleToBox method. The other end is placed in the parallel plane at
distance (center-to-center) given by the height argument, in the
direction of (xVec x yVec).
Note that spiral shapes interpret the input arguments using a different convention
than multiplanar shapes.  For spiral shapes, the spiral start will be placed in
the rectangle defined by origin, xVec, yVec, and the end of the spiral will be
placed in the parallel plane.  For multiplanar shapes, the rebar is placed with
its primary shape definition located in the parallel plane defined by the height
argument, and its connector segments extending in the direction opposite (xVec x yVec).
This method replaces ScaleToBoxForSpiral() from prior releases.
origin:
One corner of the rectangle.
xVec:
Vector representing the first edge of the rectangle. The length
must be positive.
yVec:
Vector representing the second edge of the rectangle. Must
be perpendicular to xVec.
height:
New value for the Height or MultiplanarDepth property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor is not an instance of a spiral or multiplanar shape.
-or-
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
-or-
The operation has failed for geometric reasons, such as the box being too small
given the bar diameter.
Since:
2018

Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.ScaleToBox(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Move and resize the bar to fit within a specified box.
The arguments are interpreted as an arbitrary
rectangle in 3D with vertices: origin, origin+xVec,
origin+xVec+yVec, origin+yVec. The algorithm then
proceeds as follows. First the bar is given the
default values of the shape parameters from the shape
definition. Then, if it is possible to do so without
violating the shape definition, the parameter values
are scaled so that the width and height of the shape
(including bar thickness) match the lengths of xVec and yVec.
If there is no way to do this within the shape definition
due to overconstraining, a compromise is attempted, such as
scaling the whole shape until either the width or the
height is correct. Finally the shape is rotated to
match the coordinate system of the box. The algorithm
is the same one used in one-click placement.
origin:
One corner of the rectangle.
xVec:
Vector representing the first edge of the rectangle. The length
must be positive.
yVec:
Vector representing the second edge of the rectangle. Must
be perpendicular to xVec.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This RebarShapeDrivenAccessor is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
-or-
The operation has failed for geometric reasons, such as the box being too small
given the bar diameter.
Since:
2018